brilliantlabsAR/frame-codebase/libraries/nrf5sdk/crypto/nrf_crypto_ecc.h
typedef nrf_crypto_backend_secp160r1_key_pair_generate_context_t
    nrf_crypto_ecc_secp160r1_key_pair_generate_context_t;            /**< @brief Context structure for key generation using secp160r1 (NIST 160-bit). */
typedef nrf_crypto_backend_secp160r1_public_key_calculate_context_t
    nrf_crypto_ecc_secp160r1_public_key_calculate_context_t;         /**< @brief Context structure for public key calculation using secp160r1 (NIST 160-bit). */
typedef nrf_crypto_backend_secp160r1_private_key_t
    nrf_crypto_ecc_secp160r1_private_key_t;                          /**< @brief Structure holding internal representation of a private key for secp160r1 (NIST 160-bit) */
typedef nrf_crypto_backend_secp160r1_public_key_t
    nrf_crypto_ecc_secp160r1_public_key_t;                           /**< @brief Structure holding internal representation of a public key for secp160r1 (NIST 160-bit) */
typedef uint8_t nrf_crypto_ecc_secp160r1_raw_private_key_t
    [NRF_CRYPTO_ECC_SECP160R1_RAW_PRIVATE_KEY_SIZE];                 /**< @brief Array holding raw private key for secp160r1 (NIST 160-bit) */
typedef uint8_t nrf_crypto_ecc_secp160r1_raw_public_key_t
    [NRF_CRYPTO_ECC_SECP160R1_RAW_PUBLIC_KEY_SIZE];                  /**< @brief Array holding raw public key for secp160r1 (NIST 160-bit) */



/** @brief Variable containing information on secp160r1 (NIST 160-bit).
 *
 *  It can be used as a parameter for the functions creating secp160r1 (NIST 160-bit) keys.
 */
extern const nrf_crypto_ecc_curve_info_t g_nrf_crypto_ecc_secp160r1_curve_info;


/** @} */


/** @addtogroup nrf_crypto_ecc_secp160r2
 *  @{ */

typedef nrf_crypto_backend_secp160r2_key_pair_generate_context_t
    nrf_crypto_ecc_secp160r2_key_pair_generate_context_t;            /**< @brief Context structure for key generation using secp160r2 (NIST 160-bit). */
typedef nrf_crypto_backend_secp160r2_public_key_calculate_context_t
    nrf_crypto_ecc_secp160r2_public_key_calculate_context_t;         /**< @brief Context structure for public key calculation using secp160r2 (NIST 160-bit). */
typedef nrf_crypto_backend_secp160r2_private_key_t
    nrf_crypto_ecc_secp160r2_private_key_t;                          /**< @brief Structure holding internal representation of a private key for secp160r2 (NIST 160-bit) */
typedef nrf_crypto_backend_secp160r2_public_key_t
    nrf_crypto_ecc_secp160r2_public_key_t;                           /**< @brief Structure holding internal representation of a public key for secp160r2 (NIST 160-bit) */
typedef uint8_t nrf_crypto_ecc_secp160r2_raw_private_key_t
    [NRF_CRYPTO_ECC_SECP160R2_RAW_PRIVATE_KEY_SIZE];                 /**< @brief Array holding raw private key for secp160r2 (NIST 160-bit) */
typedef uint8_t nrf_crypto_ecc_secp160r2_raw_public_key_t
    [NRF_CRYPTO_ECC_SECP160R2_RAW_PUBLIC_KEY_SIZE];                  /**< @brief Array holding raw public key for secp160r2 (NIST 160-bit) */



/** @brief Variable containing information on secp160r2 (NIST 160-bit).
 *
 *  It can be used as a parameter for the functions creating secp160r2 (NIST 160-bit) keys.
 */
extern const nrf_crypto_ecc_curve_info_t g_nrf_crypto_ecc_secp160r2_curve_info;


/** @} */


/** @addtogroup nrf_crypto_ecc_secp192r1
 *  @{ */

typedef nrf_crypto_backend_secp192r1_key_pair_generate_context_t
    nrf_crypto_ecc_secp192r1_key_pair_generate_context_t;            /**< @brief Context structure for key generation using secp192r1 (NIST 192-bit). */
typedef nrf_crypto_backend_secp192r1_public_key_calculate_context_t
    nrf_crypto_ecc_secp192r1_public_key_calculate_context_t;         /**< @brief Context structure for public key calculation using secp192r1 (NIST 192-bit). */
typedef nrf_crypto_backend_secp192r1_private_key_t
    nrf_crypto_ecc_secp192r1_private_key_t;                          /**< @brief Structure holding internal representation of a private key for secp192r1 (NIST 192-bit) */
typedef nrf_crypto_backend_secp192r1_public_key_t
    nrf_crypto_ecc_secp192r1_public_key_t;                           /**< @brief Structure holding internal representation of a public key for secp192r1 (NIST 192-bit) */
typedef uint8_t nrf_crypto_ecc_secp192r1_raw_private_key_t
    [NRF_CRYPTO_ECC_SECP192R1_RAW_PRIVATE_KEY_SIZE];                 /**< @brief Array holding raw private key for secp192r1 (NIST 192-bit) */
typedef uint8_t nrf_crypto_ecc_secp192r1_raw_public_key_t
    [NRF_CRYPTO_ECC_SECP192R1_RAW_PUBLIC_KEY_SIZE];                  /**< @brief Array holding raw public key for secp192r1 (NIST 192-bit) */



/** @brief Variable containing information on secp192r1 (NIST 192-bit).
 *
 *  It can be used as a parameter for the functions creating secp192r1 (NIST 192-bit) keys.
 */
extern const nrf_crypto_ecc_curve_info_t g_nrf_crypto_ecc_secp192r1_curve_info;


/** @} */


/** @addtogroup nrf_crypto_ecc_secp224r1
 *  @{ */

typedef nrf_crypto_backend_secp224r1_key_pair_generate_context_t
    nrf_crypto_ecc_secp224r1_key_pair_generate_context_t;            /**< @brief Context structure for key generation using secp224r1 (NIST 224-bit). */
typedef nrf_crypto_backend_secp224r1_public_key_calculate_context_t
    nrf_crypto_ecc_secp224r1_public_key_calculate_context_t;         /**< @brief Context structure for public key calculation using secp224r1 (NIST 224-bit). */
typedef nrf_crypto_backend_secp224r1_private_key_t
    nrf_crypto_ecc_secp224r1_private_key_t;                          /**< @brief Structure holding internal representation of a private key for secp224r1 (NIST 224-bit) */
typedef nrf_crypto_backend_secp224r1_public_key_t
    nrf_crypto_ecc_secp224r1_public_key_t;                           /**< @brief Structure holding internal representation of a public key for secp224r1 (NIST 224-bit) */
typedef uint8_t nrf_crypto_ecc_secp224r1_raw_private_key_t
    [NRF_CRYPTO_ECC_SECP224R1_RAW_PRIVATE_KEY_SIZE];                 /**< @brief Array holding raw private key for secp224r1 (NIST 224-bit) */
typedef uint8_t nrf_crypto_ecc_secp224r1_raw_public_key_t
    [NRF_CRYPTO_ECC_SECP224R1_RAW_PUBLIC_KEY_SIZE];                  /**< @brief Array holding raw public key for secp224r1 (NIST 224-bit) */



