brilliantlabsAR/frame-codebase/libraries/nrf5sdk/crypto/nrf_crypto_ecc.h
/** @brief Variable containing information on secp224r1 (NIST 224-bit).
 *
 *  It can be used as a parameter for the functions creating secp224r1 (NIST 224-bit) keys.
 */
extern const nrf_crypto_ecc_curve_info_t g_nrf_crypto_ecc_secp224r1_curve_info;


/** @} */


/** @addtogroup nrf_crypto_ecc_secp256r1
 *  @{ */

typedef nrf_crypto_backend_secp256r1_key_pair_generate_context_t
    nrf_crypto_ecc_secp256r1_key_pair_generate_context_t;            /**< @brief Context structure for key generation using secp256r1 (NIST 256-bit). */
typedef nrf_crypto_backend_secp256r1_public_key_calculate_context_t
    nrf_crypto_ecc_secp256r1_public_key_calculate_context_t;         /**< @brief Context structure for public key calculation using secp256r1 (NIST 256-bit). */
typedef nrf_crypto_backend_secp256r1_private_key_t
    nrf_crypto_ecc_secp256r1_private_key_t;                          /**< @brief Structure holding internal representation of a private key for secp256r1 (NIST 256-bit) */
typedef nrf_crypto_backend_secp256r1_public_key_t
    nrf_crypto_ecc_secp256r1_public_key_t;                           /**< @brief Structure holding internal representation of a public key for secp256r1 (NIST 256-bit) */
typedef uint8_t nrf_crypto_ecc_secp256r1_raw_private_key_t
    [NRF_CRYPTO_ECC_SECP256R1_RAW_PRIVATE_KEY_SIZE];                 /**< @brief Array holding raw private key for secp256r1 (NIST 256-bit) */
typedef uint8_t nrf_crypto_ecc_secp256r1_raw_public_key_t
    [NRF_CRYPTO_ECC_SECP256R1_RAW_PUBLIC_KEY_SIZE];                  /**< @brief Array holding raw public key for secp256r1 (NIST 256-bit) */



/** @brief Variable containing information on secp256r1 (NIST 256-bit).
 *
 *  It can be used as a parameter for the functions creating secp256r1 (NIST 256-bit) keys.
 */
extern const nrf_crypto_ecc_curve_info_t g_nrf_crypto_ecc_secp256r1_curve_info;


/** @} */


/** @addtogroup nrf_crypto_ecc_secp384r1
 *  @{ */

typedef nrf_crypto_backend_secp384r1_key_pair_generate_context_t
    nrf_crypto_ecc_secp384r1_key_pair_generate_context_t;            /**< @brief Context structure for key generation using secp384r1 (NIST 384-bit). */
typedef nrf_crypto_backend_secp384r1_public_key_calculate_context_t
    nrf_crypto_ecc_secp384r1_public_key_calculate_context_t;         /**< @brief Context structure for public key calculation using secp384r1 (NIST 384-bit). */
typedef nrf_crypto_backend_secp384r1_private_key_t
    nrf_crypto_ecc_secp384r1_private_key_t;                          /**< @brief Structure holding internal representation of a private key for secp384r1 (NIST 384-bit) */
typedef nrf_crypto_backend_secp384r1_public_key_t
    nrf_crypto_ecc_secp384r1_public_key_t;                           /**< @brief Structure holding internal representation of a public key for secp384r1 (NIST 384-bit) */
typedef uint8_t nrf_crypto_ecc_secp384r1_raw_private_key_t
    [NRF_CRYPTO_ECC_SECP384R1_RAW_PRIVATE_KEY_SIZE];                 /**< @brief Array holding raw private key for secp384r1 (NIST 384-bit) */
typedef uint8_t nrf_crypto_ecc_secp384r1_raw_public_key_t
    [NRF_CRYPTO_ECC_SECP384R1_RAW_PUBLIC_KEY_SIZE];                  /**< @brief Array holding raw public key for secp384r1 (NIST 384-bit) */



/** @brief Variable containing information on secp384r1 (NIST 384-bit).
 *
 *  It can be used as a parameter for the functions creating secp384r1 (NIST 384-bit) keys.
 */
extern const nrf_crypto_ecc_curve_info_t g_nrf_crypto_ecc_secp384r1_curve_info;


/** @} */


/** @addtogroup nrf_crypto_ecc_secp521r1
 *  @{ */

typedef nrf_crypto_backend_secp521r1_key_pair_generate_context_t
    nrf_crypto_ecc_secp521r1_key_pair_generate_context_t;            /**< @brief Context structure for key generation using secp521r1 (NIST 521-bit). */
typedef nrf_crypto_backend_secp521r1_public_key_calculate_context_t
    nrf_crypto_ecc_secp521r1_public_key_calculate_context_t;         /**< @brief Context structure for public key calculation using secp521r1 (NIST 521-bit). */
typedef nrf_crypto_backend_secp521r1_private_key_t
    nrf_crypto_ecc_secp521r1_private_key_t;                          /**< @brief Structure holding internal representation of a private key for secp521r1 (NIST 521-bit) */
typedef nrf_crypto_backend_secp521r1_public_key_t
    nrf_crypto_ecc_secp521r1_public_key_t;                           /**< @brief Structure holding internal representation of a public key for secp521r1 (NIST 521-bit) */
typedef uint8_t nrf_crypto_ecc_secp521r1_raw_private_key_t
    [NRF_CRYPTO_ECC_SECP521R1_RAW_PRIVATE_KEY_SIZE];                 /**< @brief Array holding raw private key for secp521r1 (NIST 521-bit) */
typedef uint8_t nrf_crypto_ecc_secp521r1_raw_public_key_t
    [NRF_CRYPTO_ECC_SECP521R1_RAW_PUBLIC_KEY_SIZE];                  /**< @brief Array holding raw public key for secp521r1 (NIST 521-bit) */



/** @brief Variable containing information on secp521r1 (NIST 521-bit).
 *
 *  It can be used as a parameter for the functions creating secp521r1 (NIST 521-bit) keys.
 */
extern const nrf_crypto_ecc_curve_info_t g_nrf_crypto_ecc_secp521r1_curve_info;


/** @} */


/** @addtogroup nrf_crypto_ecc_secp160k1
 *  @{ */

typedef nrf_crypto_backend_secp160k1_key_pair_generate_context_t
    nrf_crypto_ecc_secp160k1_key_pair_generate_context_t;            /**< @brief Context structure for key generation using secp160k1 (Koblitz 160-bit). */
typedef nrf_crypto_backend_secp160k1_public_key_calculate_context_t
    nrf_crypto_ecc_secp160k1_public_key_calculate_context_t;         /**< @brief Context structure for public key calculation using secp160k1 (Koblitz 160-bit). */
typedef nrf_crypto_backend_secp160k1_private_key_t
    nrf_crypto_ecc_secp160k1_private_key_t;                          /**< @brief Structure holding internal representation of a private key for secp160k1 (Koblitz 160-bit) */
typedef nrf_crypto_backend_secp160k1_public_key_t
    nrf_crypto_ecc_secp160k1_public_key_t;                           /**< @brief Structure holding internal representation of a public key for secp160k1 (Koblitz 160-bit) */
typedef uint8_t nrf_crypto_ecc_secp160k1_raw_private_key_t
    [NRF_CRYPTO_ECC_SECP160K1_RAW_PRIVATE_KEY_SIZE];                 /**< @brief Array holding raw private key for secp160k1 (Koblitz 160-bit) */
typedef uint8_t nrf_crypto_ecc_secp160k1_raw_public_key_t
    [NRF_CRYPTO_ECC_SECP160K1_RAW_PUBLIC_KEY_SIZE];                  /**< @brief Array holding raw public key for secp160k1 (Koblitz 160-bit) */



/** @brief Variable containing information on secp160k1 (Koblitz 160-bit).
 *
 *  It can be used as a parameter for the functions creating secp160k1 (Koblitz 160-bit) keys.
 */
extern const nrf_crypto_ecc_curve_info_t g_nrf_crypto_ecc_secp160k1_curve_info;


/** @} */


/** @addtogroup nrf_crypto_ecc_secp192k1
 *  @{ */

