brilliantlabsAR/frame-codebase/libraries/nrf5sdk/crypto/nrf_crypto_ecc.h
typedef nrf_crypto_backend_secp192k1_key_pair_generate_context_t
    nrf_crypto_ecc_secp192k1_key_pair_generate_context_t;            /**< @brief Context structure for key generation using secp192k1 (Koblitz 192-bit). */
typedef nrf_crypto_backend_secp192k1_public_key_calculate_context_t
    nrf_crypto_ecc_secp192k1_public_key_calculate_context_t;         /**< @brief Context structure for public key calculation using secp192k1 (Koblitz 192-bit). */
typedef nrf_crypto_backend_secp192k1_private_key_t
    nrf_crypto_ecc_secp192k1_private_key_t;                          /**< @brief Structure holding internal representation of a private key for secp192k1 (Koblitz 192-bit) */
typedef nrf_crypto_backend_secp192k1_public_key_t
    nrf_crypto_ecc_secp192k1_public_key_t;                           /**< @brief Structure holding internal representation of a public key for secp192k1 (Koblitz 192-bit) */
typedef uint8_t nrf_crypto_ecc_secp192k1_raw_private_key_t
    [NRF_CRYPTO_ECC_SECP192K1_RAW_PRIVATE_KEY_SIZE];                 /**< @brief Array holding raw private key for secp192k1 (Koblitz 192-bit) */
typedef uint8_t nrf_crypto_ecc_secp192k1_raw_public_key_t
    [NRF_CRYPTO_ECC_SECP192K1_RAW_PUBLIC_KEY_SIZE];                  /**< @brief Array holding raw public key for secp192k1 (Koblitz 192-bit) */



/** @brief Variable containing information on secp192k1 (Koblitz 192-bit).
 *
 *  It can be used as a parameter for the functions creating secp192k1 (Koblitz 192-bit) keys.
 */
extern const nrf_crypto_ecc_curve_info_t g_nrf_crypto_ecc_secp192k1_curve_info;


/** @} */


/** @addtogroup nrf_crypto_ecc_secp224k1
 *  @{ */

typedef nrf_crypto_backend_secp224k1_key_pair_generate_context_t
    nrf_crypto_ecc_secp224k1_key_pair_generate_context_t;            /**< @brief Context structure for key generation using secp224k1 (Koblitz 224-bit). */
typedef nrf_crypto_backend_secp224k1_public_key_calculate_context_t
    nrf_crypto_ecc_secp224k1_public_key_calculate_context_t;         /**< @brief Context structure for public key calculation using secp224k1 (Koblitz 224-bit). */
typedef nrf_crypto_backend_secp224k1_private_key_t
    nrf_crypto_ecc_secp224k1_private_key_t;                          /**< @brief Structure holding internal representation of a private key for secp224k1 (Koblitz 224-bit) */
typedef nrf_crypto_backend_secp224k1_public_key_t
    nrf_crypto_ecc_secp224k1_public_key_t;                           /**< @brief Structure holding internal representation of a public key for secp224k1 (Koblitz 224-bit) */
typedef uint8_t nrf_crypto_ecc_secp224k1_raw_private_key_t
    [NRF_CRYPTO_ECC_SECP224K1_RAW_PRIVATE_KEY_SIZE];                 /**< @brief Array holding raw private key for secp224k1 (Koblitz 224-bit) */
typedef uint8_t nrf_crypto_ecc_secp224k1_raw_public_key_t
    [NRF_CRYPTO_ECC_SECP224K1_RAW_PUBLIC_KEY_SIZE];                  /**< @brief Array holding raw public key for secp224k1 (Koblitz 224-bit) */



/** @brief Variable containing information on secp224k1 (Koblitz 224-bit).
 *
 *  It can be used as a parameter for the functions creating secp224k1 (Koblitz 224-bit) keys.
 */
extern const nrf_crypto_ecc_curve_info_t g_nrf_crypto_ecc_secp224k1_curve_info;


/** @} */


/** @addtogroup nrf_crypto_ecc_secp256k1
 *  @{ */

typedef nrf_crypto_backend_secp256k1_key_pair_generate_context_t
    nrf_crypto_ecc_secp256k1_key_pair_generate_context_t;            /**< @brief Context structure for key generation using secp256k1 (Koblitz 256-bit). */
typedef nrf_crypto_backend_secp256k1_public_key_calculate_context_t
    nrf_crypto_ecc_secp256k1_public_key_calculate_context_t;         /**< @brief Context structure for public key calculation using secp256k1 (Koblitz 256-bit). */
typedef nrf_crypto_backend_secp256k1_private_key_t
    nrf_crypto_ecc_secp256k1_private_key_t;                          /**< @brief Structure holding internal representation of a private key for secp256k1 (Koblitz 256-bit) */
typedef nrf_crypto_backend_secp256k1_public_key_t
    nrf_crypto_ecc_secp256k1_public_key_t;                           /**< @brief Structure holding internal representation of a public key for secp256k1 (Koblitz 256-bit) */
typedef uint8_t nrf_crypto_ecc_secp256k1_raw_private_key_t
    [NRF_CRYPTO_ECC_SECP256K1_RAW_PRIVATE_KEY_SIZE];                 /**< @brief Array holding raw private key for secp256k1 (Koblitz 256-bit) */
typedef uint8_t nrf_crypto_ecc_secp256k1_raw_public_key_t
    [NRF_CRYPTO_ECC_SECP256K1_RAW_PUBLIC_KEY_SIZE];                  /**< @brief Array holding raw public key for secp256k1 (Koblitz 256-bit) */



/** @brief Variable containing information on secp256k1 (Koblitz 256-bit).
 *
 *  It can be used as a parameter for the functions creating secp256k1 (Koblitz 256-bit) keys.
 */
extern const nrf_crypto_ecc_curve_info_t g_nrf_crypto_ecc_secp256k1_curve_info;


/** @} */


/** @addtogroup nrf_crypto_ecc_bp256r1
 *  @{ */

typedef nrf_crypto_backend_bp256r1_key_pair_generate_context_t
    nrf_crypto_ecc_bp256r1_key_pair_generate_context_t;              /**< @brief Context structure for key generation using bp256r1 (Brainpool 256-bit). */
typedef nrf_crypto_backend_bp256r1_public_key_calculate_context_t
    nrf_crypto_ecc_bp256r1_public_key_calculate_context_t;           /**< @brief Context structure for public key calculation using bp256r1 (Brainpool 256-bit). */
typedef nrf_crypto_backend_bp256r1_private_key_t
    nrf_crypto_ecc_bp256r1_private_key_t;                            /**< @brief Structure holding internal representation of a private key for bp256r1 (Brainpool 256-bit) */
typedef nrf_crypto_backend_bp256r1_public_key_t
    nrf_crypto_ecc_bp256r1_public_key_t;                             /**< @brief Structure holding internal representation of a public key for bp256r1 (Brainpool 256-bit) */
typedef uint8_t nrf_crypto_ecc_bp256r1_raw_private_key_t
    [NRF_CRYPTO_ECC_BP256R1_RAW_PRIVATE_KEY_SIZE];                   /**< @brief Array holding raw private key for bp256r1 (Brainpool 256-bit) */
typedef uint8_t nrf_crypto_ecc_bp256r1_raw_public_key_t
    [NRF_CRYPTO_ECC_BP256R1_RAW_PUBLIC_KEY_SIZE];                    /**< @brief Array holding raw public key for bp256r1 (Brainpool 256-bit) */



/** @brief Variable containing information on bp256r1 (Brainpool 256-bit).
 *
 *  It can be used as a parameter for the functions creating bp256r1 (Brainpool 256-bit) keys.
 */
extern const nrf_crypto_ecc_curve_info_t g_nrf_crypto_ecc_bp256r1_curve_info;


/** @} */


/** @addtogroup nrf_crypto_ecc_bp384r1
 *  @{ */

